Revit 2027 API
BuiltInFailures.BendFailures.BendAngleIsUnacceptable Property
 The angle of the bend/elbow is unacceptable
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BendAngleIsUnacceptable { get; }
Public Shared ReadOnly Property BendAngleIsUnacceptable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BendAngleIsUnacceptable {
	FailureDefinitionId^ get ();
}
static member BendAngleIsUnacceptable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace